zephyrproject-rtos/hal_stm32/lib/stm32_psa_crypto_drivers/stm32_psa_transparent_drivers/core/src/stm32_hal_aead.c
/**
  ******************************************************************************
  * @file    stm32_hal_aead.c
  * @author  MCD Application Team
  * @brief   Implementation of STM32 AES Middleware Core module
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include <mbedtls/constant_time.h>

#include "stm32_hal_aes.h"
#include "stm32_hal_aead.h"
#include "stm32_hal_aes_private.h"
#include "stm32_hal_core_config.h"
#include "stm32_hal_private.h"
#include "stm32_soc_hal.h"

#include <string.h>
#include <stdlib.h>

/*
 * PSA Crypto API specification says that for CCM operations psa_set_lengths() must be
 * called before psa_set_nonce(). However, the tf-psa-crypto tests does not expect this behavior
 * and there are no strong reason why it should be enforced but possibly slightly optimizing
 * memory footprint for PSA Crypto drivers.
 * Enable definition of macro ENFORCE_PSA_CRYPTO_CCM_NONCE_AFTER_LENGTHS to
 * strictly follow PSA Crypto API specification on this topic.
 *
 * The config is disabled by default.
 */
#ifndef ENFORCE_PSA_CRYPTO_CCM_NONCE_AFTER_LENGTHS
#define ENFORCE_PSA_CRYPTO_CCM_NONCE_AFTER_LENGTHS     0
#endif /* ENFORCE_PSA_CRYPTO_CCM_NONCE_AFTER_LENGTHS */

/*
 * PSA Crypto tests expects psa_aead_update() to compute and output all output
 * data when last bytes are reached. This breaks the PSA Crypto API since a
 * call to psa_aead_update() may not generate all output bytes and rely on
 * psa_aead_finish() or psa_aead_verify() to output the last bytes.
 * See for example test_suite_psa_crypto, case starting with string ID
 * "PSA Multipart AEAD encrypt: AES - CCM,".
 *
 * ENFORCE_PSA_CRYPTO_AEAD_UPDATE_OUTPUT_LAST_BYTES can be enabled to
 * conform this the test behavior (not waiting psa_aead_finish()/verify() to
 * output the message mast bytes).
 *
 * The config is enabled by default.
 */
#ifndef ENFORCE_PSA_CRYPTO_AEAD_UPDATE_OUTPUT_LAST_BYTES
#define ENFORCE_PSA_CRYPTO_AEAD_UPDATE_OUTPUT_LAST_BYTES        1
#endif /* ENFORCE_PSA_CRYPTO_AEAD_UPDATE_OUTPUT_LAST_BYTES */

#ifdef STM32_HAL_AES_AEAD_DRIVER_ENABLED

static STM32_HalStatusTypeDef stm32_hal_aead_set_algo_id(stm32_hal_aes_ctx_t *ctx,
                                                         STM32_HalAesAlgTypeDef alg)
{
  switch (alg)
  {
  case STM32_HAL_ALG_AES_GCM:
  case STM32_HAL_ALG_AES_CCM:
    break;
  default:
    return STM32_HAL_ERROR_NOT_SUPPORTED;
  }

  ctx->algo_id = alg;

  return STM32_HAL_SUCCESS;
}

static STM32_HalStatusTypeDef stm32_hal_aead_set_tag_size(stm32_hal_aes_ctx_t *ctx,
                                                          size_t tag_size)
{
  switch (ctx->algo_id)
  {
  case STM32_HAL_ALG_AES_GCM:
    if ((tag_size < 4) || (tag_size > 16))
    {
      return STM32_HAL_INVALID_ARGUMENT;
    }
    break;
  case STM32_HAL_ALG_AES_CCM:
    if (((tag_size % 2) != 0) || (tag_size < 4) || (tag_size > 16))
    {
      return STM32_HAL_INVALID_ARGUMENT;
    }
    break;
  default:
    return STM32_HAL_ERROR_NOT_SUPPORTED;
  }

  ctx->aead_config.tag_size = tag_size;

  return STM32_HAL_SUCCESS;
}

/*
 * Prepare CCM B0 data (stored in SoC IVR registers)
 * This requires message length, nonce length and addition data length are known.
 */
static STM32_HalStatusTypeDef prepare_ccm_b0(stm32_hal_aes_ctx_t *ctx)
{
  uint32_t iv_data[STM32_CIPHER_BLOCK_SIZE / sizeof(uint32_t)] = {0};
  size_t nonce_size = ctx->aead_config.nonce_size;
  uint8_t *iv_byte_ptr = (uint8_t *)iv_data;
  size_t len_left;
  uint32_t i;
  uint8_t q;

  ASSERT(ctx->algo_id == STM32_HAL_ALG_AES_CCM);
  ASSERT((nonce_size >= 7) && (nonce_size <= 13));

  /* Nonce was stored in ctx->iv[] first bytes */
  (void)memcpy(iv_byte_ptr + 1, ctx->iv, nonce_size);

  q = 15 - nonce_size;

  iv_byte_ptr[0] = ((ctx->aead_config.tag_size - 2U) / 2U) << 3U;
  iv_byte_ptr[0] |= q - 1U;
  if (ctx->aead_config.aad_size != 0)
  {
    iv_byte_ptr[0] |= 1U << 6U;
  }

  for (i = 0, len_left = ctx->aead_config.message_size; i < q; i++, len_left >>= 8)
  {
    iv_byte_ptr[15 - i] = (uint8_t)(len_left & 0xff);
  }

  if (len_left > 0U)
  {
    return STM32_HAL_INVALID_ARGUMENT;
  }

  /* First authentication block in little-endian format */
#ifdef STM32_AES_HAL_V1_L4
  memcpy(ctx->iv, iv_byte_ptr, sizeof(iv_data));
#else
  read_u32_swapped(ctx->iv, iv_byte_ptr, sizeof(iv_data));
#endif

  return STM32_HAL_SUCCESS;
}

/*
 * Prepare CCM B1 data buffer (headered buffer for additional data).
 * Requires the number of additional data is known.
 */
static STM32_HalStatusTypeDef prepare_ccm_b1_buffer(stm32_hal_aes_ctx_t *ctx)
{
  uint8_t *b1_padded_addr;
  size_t b1_header_size;
  size_t b1_length;
  size_t ad_length;

  ASSERT(ctx->algo_id == STM32_HAL_ALG_AES_CCM);
  ASSERT(ctx->aead_config.aad_size_set);

  ad_length = ctx->aead_config.aad_size;

  if ((uint64_t)ad_length > 0xff00)
  {
    return STM32_HAL_ERROR_NOT_SUPPORTED;
  }

  /* Currently support only length below 0xff00 hence a header of 2 bytes */
  b1_header_size = 2;

  /* Round up buffer length to 32bit words */
  b1_length = ((ad_length + b1_header_size + 3U) / 4U) * 4U;

  b1_padded_addr = calloc(1, b1_length);
  if (b1_padded_addr == NULL)
  {
    return STM32_HAL_OUT_OF_MEMORY;
  }

  /* Header: additional data length */
  b1_padded_addr[0] = (uint8_t)((ad_length >> 8) & 0xFF);
  b1_padded_addr[1] = (uint8_t)(ad_length & 0xFF);

  /* blocks (B) associated to the Associated Data (A) */
  ctx->aead_config.aad_b1 = (uint32_t *)b1_padded_addr;
  ctx->aead_config.b1_size = b1_length;

  return STM32_HAL_SUCCESS;
}

