zephyrproject-rtos/hal_stm32/lib/stm32_psa_crypto_drivers/stm32_psa_transparent_drivers/core/src/stm32_hal_aead.c
/*
 * Finalize setup of CCM B0/B1 buffers once message size, additional data size
 * and tag size are known.
 */
static STM32_HalStatusTypeDef stm32_aead_hal_finalize_ccm_config(stm32_hal_aes_ctx_t *ctx)
{
  STM32_HalStatusTypeDef status;

  status = prepare_ccm_b0(ctx);
  if (status == STM32_HAL_SUCCESS)
  {
    status = prepare_ccm_b1_buffer(ctx);
  }

  return status;
}

/*
 * Load operation configuration in the HAL driver.
 * This function requires that the device access mutex is locked.
 */
static STM32_HalStatusTypeDef stm32_aead_hal_configure(stm32_hal_aes_ctx_t *ctx)
{
  uint32_t hal_key_size_id;
  STM32_HalStatusTypeDef status;

  if (ctx->aead_config.nonce_size == 0)
  {
    return STM32_HAL_BAD_STATE;
  }

  /*
   * Before configuring the HAL, finalize the configuration for CCM
   * oprations.
   */
  if (ctx->algo_id == STM32_HAL_ALG_AES_CCM)
  {
    if (!ctx->aead_config.message_size_set || !ctx->aead_config.aad_size_set)
    {
      return STM32_HAL_BAD_STATE;
    }

    /*
     * If no additional data, stm32_aead_hal_finalize_ccm_config() has not
     * been called yet.
     */
    if (ctx->aead_config.aad_size == 0)
    {
      status = stm32_aead_hal_finalize_ccm_config(ctx);
      if (status != STM32_HAL_SUCCESS)
      {
        return status;
      }
    }
  }

  status = stm32_hal_aes_key_size_id(ctx->key_byte_size, &hal_key_size_id);
  if (status != STM32_HAL_SUCCESS)
  {
    return status;
  }

#ifdef STM32_AES_HAL_V2
  /*
   * HAL2 sequence to initialize and configure the HAL driver:
   * - Call HAL_AES_Init() with the device reference,
   *   already done by STM32_HalAesInit() above.
   * - Call HAL_AES_SetXxxlKey() to register target key references
   * - Call HAL_AES_xxx_SetConfig() with the configuration data
   * - Call HAL_AES_SetDataSwapping() last, if needed
   */
  if (HAL_AES_SetNormalKey(&ctx->hal_handle, hal_key_size_id, ctx->key) != HAL_OK)
  {
    return STM32_HAL_ERROR;
  }

  if (ctx->algo_id == STM32_HAL_ALG_AES_GCM)
  {
    hal_aes_gcm_config_t conf = {
      .p_init_vect = ctx->iv,
      .p_header = ctx->aead_config.aad_b1,
      .header_size_byte = ctx->aead_config.b1_size,
    };

    if (HAL_AES_GCM_GMAC_SetConfig(&ctx->hal_handle, &conf) != HAL_OK)
    {
      return STM32_HAL_ERROR;
    }
  }
  else
  {
    hal_aes_ccm_config_t conf = {
      .p_b0 = ctx->iv,
      .p_header = ctx->aead_config.aad_b1,
      .header_size_byte = ctx->aead_config.b1_size,
    };

    if (HAL_AES_CCM_SetConfig(&ctx->hal_handle, &conf) != HAL_OK)
    {
      return STM32_HAL_ERROR;
    }
  }

  if (HAL_AES_SetDataSwapping(&ctx->hal_handle, HAL_AES_DATA_SWAPPING_BYTE) != HAL_OK)
  {
    return STM32_HAL_ERROR;
  }
#elif defined(STM32_AES_HAL_V1_L4)
  /*
   * HAL sequence for stm32l4/l1/l0 to initialize and configure the HAL driver:
   * - Set .Instance field in device handle and call HAL_CRYP_DeInit(),
   *   already done by STM32_HalAesInit() above.
   * - Set all needed field in the .Init struct of the device handl
   * - Set init phase ID in .Init struct and run init phase with HAL_CRYPEx_AES_Auth()
   * - Set header phase ID in .Init struct and run header phase with HAL_CRYPEx_AES_Auth()
   *   Needed only if thre are Authentication Additional Data
   * - Set payload phase ID in .Init struct to be ready to process input data
   */

  if (HAL_CRYP_DeInit(&ctx->hal_handle))
  {
    return STM32_HAL_ERROR;
  }

  ctx->hal_handle.Init.pKey = (uint8_t *)ctx->key;
  ctx->hal_handle.Init.KeySize = hal_key_size_id;
  ctx->hal_handle.Init.DataType = CRYP_DATATYPE_8B;
  ctx->hal_handle.Init.KeyWriteFlag = CRYP_KEY_WRITE_ENABLE;
  ctx->hal_handle.Init.Header = (uint8_t *)ctx->aead_config.aad_b1;
  ctx->hal_handle.Init.HeaderSize = ctx->aead_config.b1_size;
  ctx->hal_handle.Init.pInitVect = (uint8_t *)ctx->iv;

  switch (ctx->algo_id)
  {
  case STM32_HAL_ALG_AES_GCM:
    ctx->hal_handle.Init.ChainingMode = CRYP_CHAINMODE_AES_GCM_GMAC;
    break;
  case STM32_HAL_ALG_AES_CCM:
#ifdef CRYP_CHAINMODE_AES_CCM
    ctx->hal_handle.Init.ChainingMode = CRYP_CHAINMODE_AES_CCM;
#else
    ctx->hal_handle.Init.ChainingMode = CRYP_CHAINMODE_AES_CMAC;
#endif
    break;
  default:
    break;
  }

  if (ctx->encrypt)
  {
    ctx->hal_handle.Init.OperatingMode = CRYP_ALGOMODE_ENCRYPT;
  }
  else
  {
    ctx->hal_handle.Init.OperatingMode = CRYP_ALGOMODE_DECRYPT;
  }

  if (HAL_CRYP_Init(&ctx->hal_handle) != HAL_OK)
  {
    return STM32_HAL_ERROR;
  }

  ctx->hal_handle.Init.GCMCMACPhase = CRYP_INIT_PHASE;
  if (HAL_CRYPEx_AES_Auth(&ctx->hal_handle, NULL, 0, NULL, ST_HAL_AES_TIMEOUT) != HAL_OK)
  {
    return STM32_HAL_ERROR;
  }

  if (ctx->hal_handle.Init.HeaderSize != 0)
  {
    ctx->hal_handle.Init.GCMCMACPhase = CRYP_HEADER_PHASE;
    if (HAL_CRYPEx_AES_Auth(&ctx->hal_handle, NULL, 0, NULL, ST_HAL_AES_TIMEOUT) != HAL_OK)
    {
      return STM32_HAL_ERROR;
    }
  }

  /* Next are the payload data, if any */
  ctx->hal_handle.Init.GCMCMACPhase = CRYP_PAYLOAD_PHASE;

#else
  /*
   * HAL sequence for remaining AES/CRYP devices to initialize and configure the HAL driver:
   * - Set .Instance field in device handle and call HAL_CRYP_Init(),
   *   already done by STM32_HalAesInit() above.
   * - Set configuraition with a CRYP_ConfigTypeDef struct pass to HAL_CRYP_SetConfig()
   */
  CRYP_ConfigTypeDef conf;

  if (HAL_CRYP_GetConfig(&ctx->hal_handle, &conf) != HAL_OK)
  {
    return STM32_HAL_ERROR;
  }

  conf.pKey = ctx->key;
  conf.KeySize = hal_key_size_id;
  conf.DataWidthUnit = CRYP_DATAWIDTHUNIT_BYTE;
#ifdef CRYP_BYTE_SWAP
  conf.DataType = CRYP_BYTE_SWAP;
#else
  conf.DataType = CRYP_DATATYPE_8B;
#endif /* CRYP_BYTE_SWAP */
#ifdef CRYP_KEYMODE_NORMAL
  conf.KeyMode = CRYP_KEYMODE_NORMAL;
  conf.KeySelect = CRYP_KEYSEL_NORMAL;
#endif /* CRYP_KEYMODE_NORMAL */
  conf.KeyIVConfigSkip = CRYP_KEYIVCONFIG_ONCE;

  if (ctx->algo_id == STM32_HAL_ALG_AES_GCM)
  {
#ifdef CRYP_AES_GCM_GMAC
    conf.Algorithm = CRYP_AES_GCM_GMAC;
#else
    conf.Algorithm = CRYP_AES_GCM;
#endif /* CRYP_AES_GCM_GMAC */
    conf.pInitVect = ctx->iv;
  }
  else
  {
    conf.Algorithm = CRYP_AES_CCM;
    conf.B0 = ctx->iv;
  }

  conf.Header = ctx->aead_config.aad_b1;
  conf.HeaderSize = ctx->aead_config.b1_size;

#ifdef CRYP_HEADERWIDTHUNIT_BYTE
  conf.HeaderWidthUnit = CRYP_HEADERWIDTHUNIT_BYTE;

