zephyrproject-rtos/hal_stm32/lib/stm32_psa_crypto_drivers/stm32_psa_transparent_drivers/core/src/stm32_hal_aead.c
  /*
   * A few SoC series (H7RS, N6, MP13, MP2) integrate a CRYP and an SAES instances.
   * They define CRYP_HEADERWIDTHUNIT_BYTE but only the SAES intance supports byte
   * header unit. When using CRYP, the header width unit must be 32bit words.
   * For these SoCs, there exists a IS_CRYP_INSTANCE() macro. Note that the buffer allocated
   * for ctx->aead_config.aad_b1 is 32bit word aligned, as well as ctx->aead_config.b1_size.
   */
#ifdef IS_CRYP_INSTANCE
  if (IS_CRYP_INSTANCE(ctx->hal_handle.Instance))
  {
    ASSERT((conf.HeaderSize % sizeof(uint32_t)) == 0);
    conf.HeaderSize /= 4U;
    conf.HeaderWidthUnit = CRYP_HEADERWIDTHUNIT_WORD;
  }
#endif /* IS_CRYP_INSTANCE */
#endif /* CRYP_HEADERWIDTHUNIT_BYTE */

  if (HAL_CRYP_SetConfig(&ctx->hal_handle, &conf) != HAL_OK)
  {
    return STM32_HAL_ERROR;
  }
#endif /* STM32_AES_HAL_V2 */

  return STM32_HAL_SUCCESS;
}

static STM32_HalStatusTypeDef stm32_aead_process_buffer(stm32_hal_aes_ctx_t *ctx,
                                                        const uint8_t *input,
                                                        uint8_t *output,
                                                        size_t length)
{
  stm32_hal_status_t hal_status = HAL_OK;
  STM32_HalStatusTypeDef status;

  status = stm32_hal_aes_get_hal_hw(ctx, stm32_aead_hal_configure);
  if (status != STM32_HAL_SUCCESS)
  {
    return status;
  }

#ifdef STM32_AES_HAL_V2
  if (ctx->encrypt)
  {
    hal_status = HAL_AES_Encrypt(&ctx->hal_handle, (uint8_t *)input, length,
                                 output, ST_HAL_AES_TIMEOUT);
  }
  else
  {
    hal_status = HAL_AES_Decrypt(&ctx->hal_handle, (uint8_t *)input, length,
                                 output, ST_HAL_AES_TIMEOUT);
  }
#elif defined(STM32_AES_HAL_V1_L4)
  if (length != 0)
  {
    hal_status = HAL_CRYPEx_AES_Auth(&ctx->hal_handle, (uint8_t *)input, length,
                                     output, ST_HAL_AES_TIMEOUT);
  }
#else
  if (ctx->encrypt)
  {
    hal_status = HAL_CRYP_Encrypt(&ctx->hal_handle, (uint32_t *)input, length,
                                  (uint32_t *)output, ST_HAL_AES_TIMEOUT);
  }
  else
  {
    hal_status = HAL_CRYP_Decrypt(&ctx->hal_handle, (uint32_t *)input, length,
                                  (uint32_t *)output, ST_HAL_AES_TIMEOUT);
  }
#endif /* STM32_AES_HAL_V2 */

  if (hal_status == HAL_OK)
  {
    ctx->aead_config.current_message_size += length;
  }
  else
  {
    status = STM32_HAL_ERROR;
  }

  stm32_hal_aes_put_hal_hw();

  return status;
}

static STM32_HalStatusTypeDef stm32_aead_generate_tag(stm32_hal_aes_ctx_t *ctx,
                                                      uint32_t *tag)
{
  stm32_hal_status_t hal_status;
  STM32_HalStatusTypeDef status;

  /*
   * If no data, ensure the HAL is informed (process 0 bytes).
   * NOTE: stm32_aead_process_buffer() locks HW mutex itself
   * so we must not acquire it yet.
   */
  if (ctx->aead_config.current_message_size == 0)
  {
    status = stm32_aead_process_buffer(ctx, NULL, NULL, 0);
    if (status != STM32_HAL_SUCCESS)
    {
      return status;
    }
  }

  status = stm32_hal_aes_get_hal_hw(ctx, stm32_aead_hal_configure);
  if (status != STM32_HAL_SUCCESS)
  {
    return status;
  }

  if (ctx->algo_id == STM32_HAL_ALG_AES_GCM)
  {
    /* Generate GCM tag */
#ifdef STM32_AES_HAL_V2
    hal_status = HAL_AES_GCM_GenerateAuthTAG(&ctx->hal_handle, tag, ST_HAL_AES_TIMEOUT);
#elif defined(STM32_AES_HAL_V1_L4)
    ctx->hal_handle.Init.GCMCMACPhase = CRYP_FINAL_PHASE;
    hal_status = HAL_CRYPEx_AES_Auth(&ctx->hal_handle, NULL,
                                     ctx->aead_config.current_message_size,
                                     (uint8_t *)tag, ST_HAL_AES_TIMEOUT);
#else
    hal_status = HAL_CRYPEx_AESGCM_GenerateAuthTAG(&ctx->hal_handle, tag, ST_HAL_AES_TIMEOUT);
#endif /* STM32_AES_HAL_V2 */
  }
  else
  {
    /* Generate CCM tag */
#ifdef STM32_AES_HAL_V2
    hal_status = HAL_AES_CCM_GenerateAuthTAG(&ctx->hal_handle, tag, ST_HAL_AES_TIMEOUT);
#elif defined(STM32_AES_HAL_V1_L4)
    ctx->hal_handle.Init.GCMCMACPhase = CRYP_FINAL_PHASE;
    hal_status = HAL_CRYPEx_AES_Auth(&ctx->hal_handle, NULL, 0, (uint8_t *)tag, ST_HAL_AES_TIMEOUT);
#else
    hal_status = HAL_CRYPEx_AESCCM_GenerateAuthTAG(&ctx->hal_handle, tag, ST_HAL_AES_TIMEOUT);
#endif /* STM32_AES_HAL_V2 */
  }

  if (hal_status != HAL_OK)
  {
    status = STM32_HAL_ERROR;
  }

  stm32_hal_aes_put_hal_hw();

  return status;
}

/*
 * Local helper to register an opration
 * If so, increment refcount and ensure HW is clocked.
 */
static STM32_HalStatusTypeDef stm32_aead_prepare_key(stm32_hal_aes_ctx_t *ctx,
                                                     const uint8_t *key, size_t key_size)
{
  STM32_HalStatusTypeDef status;

  status = stm32_hal_aes_key_size_id(key_size, NULL);
  if (status == STM32_HAL_SUCCESS)
  {
    ctx->key_byte_size = key_size;
#if defined(STM32_AES_HAL_V1_L4)
    memcpy(ctx->key, key, key_size);
#else
    /* Key data in big-endian format */
    read_u32_swapped(ctx->key, key, key_size);
#endif /* STM32_AES_HAL_V1_L4 */
  }

  return status;
}

/*
 * Local helper to unregister an opration context and release
 * related resources.
 */
static void stm32_aead_release_context(stm32_hal_aes_ctx_t *ctx)
{
  stm32_hal_aes_release_hal_hw(ctx);

  free(ctx->aead_config.aad_b1);
  memset(ctx, 0, sizeof(*ctx));
}

/*
 * Driver API functions exposed the PSA Crypto Drivers API
 */

STM32_HalStatusTypeDef STM32_HalAeadEncryptSetup(stm32_hal_aes_ctx_t *ctx,
                                                 const uint8_t *key_buffer,
                                                 size_t key_buffer_size,
                                                 STM32_HalAesAlgTypeDef alg,
                                                 size_t tag_length)
{
  STM32_HalStatusTypeDef status;

  status = stm32_hal_aead_set_algo_id(ctx, alg);
  if (status != STM32_HAL_SUCCESS)
  {
    return status;
  }

  status = stm32_hal_aead_set_tag_size(ctx, tag_length);
  if (status != STM32_HAL_SUCCESS)
  {
    return status;
  }

  status = stm32_aead_prepare_key(ctx, key_buffer, key_buffer_size);
  if (status != STM32_HAL_SUCCESS)
  {
    return status;
  }

