zephyrproject-rtos/hal_stm32/lib/stm32_psa_crypto_drivers/stm32_psa_transparent_drivers/core/src/stm32_hal_aead.c
  ctx->encrypt = true;

  return STM32_HAL_SUCCESS;
}

STM32_HalStatusTypeDef STM32_HalAeadDecryptSetup(stm32_hal_aes_ctx_t *ctx,
                                                 const uint8_t *key_buffer,
                                                 size_t key_buffer_size,
                                                 STM32_HalAesAlgTypeDef alg,
                                                 size_t tag_length)
{
  STM32_HalStatusTypeDef status;

  status = stm32_hal_aead_set_algo_id(ctx, alg);
  if (status != STM32_HAL_SUCCESS)
  {
    return status;
  }

  status = stm32_hal_aead_set_tag_size(ctx, tag_length);
  if (status != STM32_HAL_SUCCESS)
  {
    return status;
  }

  status = stm32_aead_prepare_key(ctx, key_buffer, key_buffer_size);
  if (status != STM32_HAL_SUCCESS)
  {
    return status;
  }

  ctx->encrypt = false;

  return STM32_HAL_SUCCESS;
}

STM32_HalStatusTypeDef STM32_HalAeadSetNonce(stm32_hal_aes_ctx_t *ctx,
                                             const uint8_t *nonce, size_t nonce_length)
{
  switch (ctx->algo_id)
  {
  case STM32_HAL_ALG_AES_GCM:
    if (nonce_length != 12)
    {
      return STM32_HAL_ERROR_NOT_SUPPORTED;
    }

    ctx->aead_config.nonce_size = nonce_length;

#if defined(STM32_AES_HAL_V1_L4)
    /* Set Initialization vector (IV) in big-endian format, with counter = 2 */
    memcpy(ctx->iv, nonce, nonce_length);
    ctx->iv[3] = 0x02000000;
#else
    /* Set Initialization vector (IV) in little-endian, with counter = 2*/
    read_u32_swapped(ctx->iv, nonce, nonce_length);
    ctx->iv[3] = 0x00000002;
#endif /* STM32_AES_HAL_V1_L4 */
    break;

  case STM32_HAL_ALG_AES_CCM:
#if ENFORCE_PSA_CRYPTO_CCM_NONCE_AFTER_LENGTHS
    if (!ctx->aead_config.message_size_set || !ctx->aead_config.aad_size_set)
    {
      return STM32_HAL_INVALID_ARGUMENT;
    }
#endif /* ENFORCE_PSA_CRYPTO_CCM_NONCE_AFTER_LENGTHS */

    /* Nonce size constraints regarding q range */
    if ((nonce_length < 7) || (nonce_length > 13))
    {
      return STM32_HAL_INVALID_ARGUMENT;
    }

    /*
     * Save nonce in ct->iv[] fist bytes. It will be preprocess later to
     * generate CCM B0 data.
     */
    memcpy(ctx->iv, nonce, nonce_length);
    ctx->aead_config.nonce_size = nonce_length;
    break;

  default:
    return STM32_HAL_ERROR_NOT_SUPPORTED;
  }

  return STM32_HAL_SUCCESS;
}

STM32_HalStatusTypeDef STM32_HalAeadSetLengths(stm32_hal_aes_ctx_t *ctx,
                                               size_t ad_length,
                                               size_t plaintext_length)
{
  /*
   * Nonce/IV shall not be set yet.
   * Can't change AAD size once additional data are received.
   */
  if ((ctx->aead_config.current_aad_size != 0) ||
      (ctx->aead_config.current_message_size != 0))
  {
    return STM32_HAL_BAD_STATE;
  }

  /*
   * PSA Crypto spec: this function can be called multiple times.
   * If so, discard previous config.
   */
  if (ctx->aead_config.aad_b1 != NULL)
  {
    free(ctx->aead_config.aad_b1);
    ctx->aead_config.aad_b1 = NULL;
    ctx->aead_config.b1_size = 0;
  }

  ctx->aead_config.message_size_set = true;
  ctx->aead_config.message_size = plaintext_length;
  ctx->aead_config.aad_size_set = true;
  ctx->aead_config.aad_size = ad_length;

  switch (ctx->algo_id)
  {
  case STM32_HAL_ALG_AES_GCM:
    if (ad_length > 0)
    {
      ctx->aead_config.aad_b1 = calloc(1, ad_length);
      if (ctx->aead_config.aad_b1 == NULL)
      {
        return STM32_HAL_OUT_OF_MEMORY;
      }
    }

    ctx->aead_config.b1_size = ad_length;
    break;

  case STM32_HAL_ALG_AES_CCM:
#if ENFORCE_PSA_CRYPTO_CCM_NONCE_AFTER_LENGTHS
    if (ctx->aead_config.nonce_size != 0)
    {
      return STM32_HAL_BAD_STATE;
    }
#endif /* ENFORCE_PSA_CRYPTO_CCM_NONCE_AFTER_LENGTHS */
    /* Maybe nonce size will be known later, prepare B0/B1 later */
    break;

  default:
    return STM32_HAL_ERROR_NOT_SUPPORTED;
  }

  return STM32_HAL_SUCCESS;
}

STM32_HalStatusTypeDef STM32_HalAeadUpdateAd(stm32_hal_aes_ctx_t *ctx,
                                             const uint8_t *input, size_t input_length)
{
  STM32_HalStatusTypeDef status;
  uint8_t *aad_b1;

  if (input_length == 0)
  {
    return STM32_HAL_SUCCESS;
  }

  if (input == NULL)
  {
    return STM32_HAL_INVALID_ARGUMENT;
  }

  /* Protect from overlow */
  if ((ctx->aead_config.current_aad_size + input_length) < input_length)
  {
    return STM32_HAL_INVALID_ARGUMENT;
  }

  switch (ctx->algo_id)
  {
  case STM32_HAL_ALG_AES_GCM:
    /*
     * GCM allows to not have the AAD size pre-defined with psa_aead_set_lengths().
     * In such cases, allow concatenating any added additional data.
     */
    if (ctx->aead_config.current_aad_size + input_length > ctx->aead_config.aad_size)
    {
      size_t aad_size;

      if (ctx->aead_config.aad_size_set)
      {
        return STM32_HAL_INVALID_ARGUMENT;
      }

      aad_size = ctx->aead_config.current_aad_size + input_length;
      aad_b1 = realloc(ctx->aead_config.aad_b1, aad_size);
      if (aad_b1 == NULL)
      {
        return STM32_HAL_OUT_OF_MEMORY;
      }

      /* Update AAD and B1 buffer sizes */
      ctx->aead_config.aad_size = aad_size;
      ctx->aead_config.b1_size = aad_size;
      ctx->aead_config.aad_b1 = (uint32_t *)aad_b1;
    }
    else
    {
      aad_b1 = (uint8_t *)ctx->aead_config.aad_b1;
    }
    break;

  case STM32_HAL_ALG_AES_CCM:
    /* CCM requires message and AAD sizes are defined */
    if (!ctx->aead_config.aad_size_set || !ctx->aead_config.message_size_set ||
        ((ctx->aead_config.current_aad_size + input_length) > ctx->aead_config.aad_size))
    {
      return STM32_HAL_INVALID_ARGUMENT;
    }

    if (ctx->aead_config.current_aad_size == 0)
    {
      /*
       * Now that nonce, message size and additional data size are known
       * prepare B0/B1 buffers before we store additional data in
       * B1 buffer.
       * */
      status = stm32_aead_hal_finalize_ccm_config(ctx);
      if (status != STM32_HAL_SUCCESS)
      {
        return status;
      }
    }

    aad_b1 = (uint8_t *)ctx->aead_config.aad_b1;

    /* Skip header bytes */
    if ((aad_b1[0] == 0xFF) && (aad_b1[1] == 0xFE))
    {
      aad_b1 += 6;
    }
    else
    {
      aad_b1 += 2;
    }
    break;

  default:
    return STM32_HAL_ERROR_NOT_SUPPORTED;
  }

