zephyrproject-rtos/hal_stm32/lib/stm32_psa_crypto_drivers/stm32_psa_transparent_drivers/core/src/stm32_hal_aead.c
  memcpy(aad_b1 + ctx->aead_config.current_aad_size, input, input_length);

  ctx->aead_config.current_aad_size += input_length;

  return STM32_HAL_SUCCESS;
}

STM32_HalStatusTypeDef STM32_HalAeadUpdate(stm32_hal_aes_ctx_t *ctx,
                                           const uint8_t *input, size_t input_length,
                                           uint8_t *output, size_t output_size,
                                           size_t *output_length)
{
  size_t remaining_input_size = input_length;
  size_t updated_output_size = 0;
  STM32_HalStatusTypeDef status;
  size_t proc_size;

  /* PSA Crypto specification: additional data are fed before ciphered data */
  if (ctx->aead_config.current_aad_size != ctx->aead_config.aad_size)
  {
    return STM32_HAL_INVALID_ARGUMENT;
  }

  /* Protect from overflow in sizes addition */
  if ((ctx->aead_config.current_message_size + ctx->sbuf_len + input_length) < input_length)
  {
    return STM32_HAL_INVALID_ARGUMENT;
  }

  /* PSA Crypto specification: if message size was set, it must not exceed */
  if (ctx->aead_config.message_size_set &&
      ((ctx->aead_config.current_message_size + ctx->sbuf_len + input_length) >
       ctx->aead_config.message_size))
  {
    return STM32_HAL_INVALID_ARGUMENT;
  }

  /*
   * For consistency, expect output buffer is large enough to store all ciphered input data.
   * This is checked by some PSA tests from test_suite_psa_crypto.data.
   * This should be taken care from the generic TF PSA crypto driver framework.
   *
   * Below, when generating the output bytes, we check again the output buffer size
   * in case some input data were previosuly stored in ctx->sbuf[] and would be output
   * now.
   */
  if (output_size < input_length)
  {
    return STM32_HAL_BUFFER_TOO_SMALL;
  }

  /*
   * If not enough data to process a block yet, store data in ctx->sbuf,
   * we will processed later.
   */
  if (input_length < (STM32_CIPHER_BLOCK_SIZE - ctx->sbuf_len))
  {
    memcpy((uint8_t *)ctx->sbuf + ctx->sbuf_len, input, input_length);
    ctx->sbuf_len += input_length;

#if ENFORCE_PSA_CRYPTO_AEAD_UPDATE_OUTPUT_LAST_BYTES == 0
    *output_length = 0;

    return STM32_HAL_SUCCESS;
#else
    if ((ctx->aead_config.current_message_size + ctx->sbuf_len) ==
        ctx->aead_config.message_size)
    {
      /* Don't return now, have these last byte processed. */
      remaining_input_size = 0;
    }
    else
    {
      *output_length = 0;

      return STM32_HAL_SUCCESS;
    }
#endif /* ENFORCE_PSA_CRYPTO_AEAD_UPDATE_OUTPUT_LAST_BYTES */
  }

  /*
   * Process data:
   * - first a full block made of the previously saved data and input data first bytes
   * - then each available full blocks from input data
   * - last, save trailling input data byte for later processing
   *   Possibly process them if last message bytes.
   *
   * Note: only call stm32_aead_process_buffer() if there are data to
   * be processed. Finish and Veerify sequence will take care of informing
   * the HAL when the message is empty.
   */

  if ((ctx->sbuf_len + remaining_input_size >= STM32_CIPHER_BLOCK_SIZE))
  {
    /* Fill context buffer until STM32_CIPHER_BLOCK_SIZE bytes, and process it */
    memcpy((uint8_t *)ctx->sbuf + ctx->sbuf_len, input, STM32_CIPHER_BLOCK_SIZE - ctx->sbuf_len);
    remaining_input_size -= STM32_CIPHER_BLOCK_SIZE - ctx->sbuf_len;
    input += STM32_CIPHER_BLOCK_SIZE - ctx->sbuf_len;
    ctx->sbuf_len = 0;

    if (output_size < STM32_CIPHER_BLOCK_SIZE)
    {
      return STM32_HAL_BUFFER_TOO_SMALL;
    }

    status = stm32_aead_process_buffer(ctx, ctx->sbuf, output, STM32_CIPHER_BLOCK_SIZE);
    if (status != STM32_HAL_SUCCESS)
    {
      return status;
    }

    updated_output_size += STM32_CIPHER_BLOCK_SIZE;
    output += STM32_CIPHER_BLOCK_SIZE;
  }

  proc_size = (remaining_input_size / STM32_CIPHER_BLOCK_SIZE) * STM32_CIPHER_BLOCK_SIZE;

  if ((output_size - updated_output_size) < proc_size)
  {
    return STM32_HAL_BUFFER_TOO_SMALL;
  }

  if (proc_size != 0)
  {
    status = stm32_aead_process_buffer(ctx, input, output, proc_size);
    if (status != STM32_HAL_SUCCESS)
    {
      return status;
    }

    remaining_input_size -= proc_size;
    updated_output_size += proc_size;
    input += proc_size;
    output += proc_size;
  }

  if (remaining_input_size != 0)
  {
    memcpy(ctx->sbuf, input, remaining_input_size);
    ctx->sbuf_len = remaining_input_size;
  }

#if ENFORCE_PSA_CRYPTO_AEAD_UPDATE_OUTPUT_LAST_BYTES != 3
  /* Process now the last bytes if the output buffer is large enough */
  if ((ctx->sbuf_len != 0) &&
      ((output_size - updated_output_size) >= ctx->sbuf_len) &&
      ((ctx->aead_config.current_message_size + ctx->sbuf_len) ==
       ctx->aead_config.message_size))
  {
    /* Use local full block buffers to prevent HAL to overflow caller buffers */
    uint32_t temp_out[STM32_CIPHER_BLOCK_SIZE / sizeof(uint32_t)];

    memset(ctx->sbuf + ctx->sbuf_len, 0, sizeof(ctx->sbuf) - ctx->sbuf_len);

    status = stm32_aead_process_buffer(ctx, ctx->sbuf, (uint8_t *)temp_out, ctx->sbuf_len);
    if (status != STM32_HAL_SUCCESS)
    {
      return status;
    }

    memcpy(output, temp_out, ctx->sbuf_len);
    updated_output_size += ctx->sbuf_len;
    ctx->sbuf_len = 0;
  }
#endif /* ENFORCE_PSA_CRYPTO_AEAD_UPDATE_OUTPUT_LAST_BYTES */

  *output_length = updated_output_size;

  return STM32_HAL_SUCCESS;
}

STM32_HalStatusTypeDef STM32_HalAeadFinish(stm32_hal_aes_ctx_t *ctx,
                                           uint8_t *ciphertext, size_t ciphertext_size,
                                           size_t *ciphertext_length,
                                           uint8_t *tag, size_t tag_size,
                                           size_t *tag_length)
{
  uint32_t local_tag[STM32_CIPHER_BLOCK_SIZE / sizeof(uint32_t)];
  STM32_HalStatusTypeDef status;

  if (tag_size < ctx->aead_config.tag_size)
  {
      return STM32_HAL_BUFFER_TOO_SMALL;
  }

  /* PSA Crypto specification: additional data are fed before ciphered data */
  if (ctx->aead_config.current_aad_size != ctx->aead_config.aad_size)
  {
    return STM32_HAL_INVALID_ARGUMENT;
  }

