zephyrproject-rtos/hal_stm32/lib/stm32_psa_crypto_drivers/stm32_psa_transparent_drivers/core/src/stm32_hal_aead.c
  /* PSA Crypto specification: if message size was set, it must match */
  if (ctx->aead_config.message_size_set &&
      (ctx->aead_config.current_message_size + ctx->sbuf_len != ctx->aead_config.message_size))
  {
    return STM32_HAL_INVALID_ARGUMENT;
  }

  if ((tag == NULL) || (tag_length == NULL))
  {
    return STM32_HAL_INVALID_ARGUMENT;
  }

  if (ctx->sbuf_len != 0)
  {
    if (ciphertext_size < ctx->sbuf_len)
    {
      return STM32_HAL_BUFFER_TOO_SMALL;
    }
    if (ciphertext == NULL)
    {
      return STM32_HAL_INVALID_ARGUMENT;
    }
  }

  /* Process last bytes if any */
  if (ctx->sbuf_len != 0)
  {
    /* Use local full block buffers to prevent HAL to overflow caller buffers */
    uint32_t temp_out[STM32_CIPHER_BLOCK_SIZE / sizeof(uint32_t)];

    memset(ctx->sbuf + ctx->sbuf_len, 0, sizeof(ctx->sbuf) - ctx->sbuf_len);

    status = stm32_aead_process_buffer(ctx, ctx->sbuf, (uint8_t *)temp_out, ctx->sbuf_len);
    if (status != STM32_HAL_SUCCESS)
    {
      return status;
    }

    memcpy(ciphertext, temp_out, ctx->sbuf_len);
  }

  *ciphertext_length = ctx->sbuf_len;

  /* Generate tag */
  status = stm32_aead_generate_tag(ctx, local_tag);
  if (status != STM32_HAL_SUCCESS)
  {
    return status;
  }

  *tag_length = ctx->aead_config.tag_size;
  memcpy(tag, local_tag, ctx->aead_config.tag_size);

  return STM32_HAL_SUCCESS;
}

STM32_HalStatusTypeDef STM32_HalAeadVerify(stm32_hal_aes_ctx_t *ctx,
                                           uint8_t *plaintext, size_t plaintext_size,
                                           size_t *plaintext_length,
                                           const uint8_t *tag, size_t tag_length)
{
  uint32_t local_tag[STM32_CIPHER_BLOCK_SIZE / sizeof(uint32_t)];
  STM32_HalStatusTypeDef status;

  /* PSA Crypto specification: additional data are fed before ciphered data */
  if (ctx->aead_config.current_aad_size != ctx->aead_config.aad_size)
  {
    return STM32_HAL_INVALID_ARGUMENT;
  }

  /* PSA Crypto specification: if message size was set, it must match */
  if (ctx->aead_config.message_size_set &&
      ((ctx->aead_config.current_message_size + ctx->sbuf_len) != ctx->aead_config.message_size))
  {
    return STM32_HAL_INVALID_ARGUMENT;
  }

  if (ctx->sbuf_len != 0)
  {
    if (plaintext_size < ctx->sbuf_len)
    {
      return STM32_HAL_BUFFER_TOO_SMALL;
    }
    if (plaintext == NULL)
    {
      return STM32_HAL_INVALID_ARGUMENT;
    }
  }

  if (tag_length != ctx->aead_config.tag_size)
  {
    return STM32_HAL_INVALID_SIGNATURE;
  }

  /* Process last bytes if any */
  if (ctx->sbuf_len != 0)
  {
    /* Use local full block buffers to prevent HAL to overflow caller buffers */
    uint32_t temp_out[STM32_CIPHER_BLOCK_SIZE / sizeof(uint32_t)];

    memset(ctx->sbuf + ctx->sbuf_len, 0, sizeof(ctx->sbuf) - ctx->sbuf_len);

    status = stm32_aead_process_buffer(ctx, ctx->sbuf, (uint8_t *)temp_out, ctx->sbuf_len);
    if (status != STM32_HAL_SUCCESS)
    {
      return status;
    }

    memcpy(plaintext, temp_out, ctx->sbuf_len);
  }

  *plaintext_length = ctx->sbuf_len;

  /* Generate and check tag */
  status = stm32_aead_generate_tag(ctx, local_tag);
  if (status != STM32_HAL_SUCCESS)
  {
    return status;
  }

  if (mbedtls_ct_memcmp(tag, local_tag, tag_length) != 0)
  {
    return STM32_HAL_INVALID_SIGNATURE;
  }

  return STM32_HAL_SUCCESS;
}

STM32_HalStatusTypeDef STM32_HalAeadAbort(stm32_hal_aes_ctx_t *ctx)
{
  stm32_aead_release_context(ctx);

  return STM32_HAL_SUCCESS;
}

STM32_HalStatusTypeDef STM32_HalAesAeadEncrypt(
  STM32_HalAesAlgTypeDef alg,
  const uint8_t *p_key_buffer, size_t key_buffer_size,
  const uint8_t *p_nonce, size_t nonce_length,
  const uint8_t *p_additional_data, size_t additional_data_length,
  const uint8_t *p_plaintext, size_t plaintext_length,
  uint8_t *p_ciphertext, size_t ciphertext_size, size_t *p_ciphertext_length,
  size_t tag_length)
{
  STM32_HalStatusTypeDef status = STM32_HAL_ERROR;
  stm32_hal_aes_ctx_t ctx = {0};
  size_t cipher_length1;
  size_t cipher_length2;
  size_t tag_length_out;

  status = STM32_HalAeadEncryptSetup(&ctx, p_key_buffer, key_buffer_size, alg, tag_length);
  if (status != STM32_HAL_SUCCESS)
  {
    return status;
  }

  /*
   * Passed this point, we must release the context resource (its refcount)
   * before exiting, e.g. with stm32_aead_release_context().
   */

  /* Sanitize the input lengths */
  if ((plaintext_length + tag_length) < plaintext_length)
  {
    status = STM32_HAL_INVALID_ARGUMENT;
    goto exit;
  }

  if (ciphertext_size < (plaintext_length + tag_length))
  {
    status = STM32_HAL_BUFFER_TOO_SMALL;
    goto exit;
  }

  status = STM32_HalAeadSetLengths(&ctx, additional_data_length, plaintext_length);
  if (status != STM32_HAL_SUCCESS)
  {
    goto exit;
  }

  status = STM32_HalAeadSetNonce(&ctx, p_nonce, nonce_length);
  if (status != STM32_HAL_SUCCESS)
  {
    goto exit;
  }

  status = STM32_HalAeadUpdateAd(&ctx, p_additional_data, additional_data_length);
  if (status != STM32_HAL_SUCCESS)
  {
    goto exit;
  }

  status = STM32_HalAeadUpdate(&ctx, p_plaintext, plaintext_length,
                               p_ciphertext, ciphertext_size, &cipher_length1);
  if (status != STM32_HAL_SUCCESS)
  {
    goto exit;
  }

  status = STM32_HalAeadFinish(&ctx, p_ciphertext + cipher_length1,
                               ciphertext_size - cipher_length1, &cipher_length2,
                               p_ciphertext + plaintext_length, tag_length, &tag_length_out);
  if (status != STM32_HAL_SUCCESS)
  {
    goto exit;
  }

  if ((cipher_length1 + cipher_length2 != plaintext_length) || (tag_length_out != tag_length))
  {
    status = STM32_HAL_ERROR;
    goto exit;
  }

  *p_ciphertext_length = plaintext_length + tag_length;

  status = STM32_HAL_SUCCESS;

exit:
  stm32_aead_release_context(&ctx);

  return status;
}

STM32_HalStatusTypeDef STM32_HalAesAeadDecrypt(
  STM32_HalAesAlgTypeDef alg,
  const uint8_t *p_key_buffer, size_t key_buffer_size,
  const uint8_t *p_nonce, size_t nonce_length,
  const uint8_t *p_additional_data,
  size_t additional_data_length,
  const uint8_t *p_ciphertext, size_t ciphertext_length,
  uint8_t *p_plaintext, size_t plaintext_size, size_t *p_plaintext_length,
  size_t tag_length)
{
  STM32_HalStatusTypeDef status = STM32_HAL_ERROR;
  stm32_hal_aes_ctx_t ctx = {0};
  size_t plaintext_length1;
  size_t plaintext_length2;
  size_t cipher_length;

  ctx.encrypt = false;
  status = STM32_HalAeadDecryptSetup(&ctx, p_key_buffer, key_buffer_size, alg, tag_length);
  if (status != STM32_HAL_SUCCESS)
  {
    return status;
  }

