zephyrproject-rtos/hal_stm32/lib/stm32_psa_crypto_drivers/stm32_psa_transparent_drivers/core/src/stm32_hal_aead.c
  /*
   * Passed this point, we must release the context resource (its refcount)
   * before exiting, e.g. with stm32_aead_release_context().
   */

  /* Sanitize the input lengths */
  if (ciphertext_length < tag_length)
  {
    status = STM32_HAL_INVALID_ARGUMENT;
    goto exit;
  }

  cipher_length = ciphertext_length - tag_length;

  if (plaintext_size < cipher_length)
  {
    status = STM32_HAL_BUFFER_TOO_SMALL;
    goto exit;
  }

  if ((cipher_length == 0) && (ctx.algo_id == STM32_HAL_ALG_AES_CCM))
  {
    status = STM32_HAL_INVALID_SIGNATURE;
    goto exit;
  }

  status = STM32_HalAeadSetLengths(&ctx, additional_data_length, cipher_length);
  if (status != STM32_HAL_SUCCESS)
  {
    goto exit;
  }

  status = STM32_HalAeadSetNonce(&ctx, p_nonce, nonce_length);
  if (status != STM32_HAL_SUCCESS)
  {
    goto exit;
  }

  status = STM32_HalAeadUpdateAd(&ctx, p_additional_data, additional_data_length);
  if (status != STM32_HAL_SUCCESS)
  {
    goto exit;
  }

  status = STM32_HalAeadUpdate(&ctx, p_ciphertext, cipher_length,
                               p_plaintext, plaintext_size, &plaintext_length1);
  if (status != STM32_HAL_SUCCESS)
  {
    goto exit;
  }

  /* Generate and check tag */
  status = STM32_HalAeadVerify(&ctx, p_plaintext + plaintext_length1,
                               plaintext_size - plaintext_length1, &plaintext_length2,
                               p_ciphertext + cipher_length, tag_length);
  if (status != STM32_HAL_SUCCESS)
  {
    goto exit;
  }

  if ((plaintext_length1 + plaintext_length2) != cipher_length)
  {
    status = STM32_HAL_ERROR;
    goto exit;
  }

  *p_plaintext_length = cipher_length;

  status = STM32_HAL_SUCCESS;

exit:
  stm32_aead_release_context(&ctx);

  return status;
}

#endif /* STM32_HAL_AES_AEAD_DRIVER_ENABLED */
